app/controllers/stories_controller.rb

  def index
    @story = Story.find_by_name('name')
---
SELECT * FROM "stories" WHERE ("stories"."name" = 'name') LIMIT 1