app/controllers/stories_controller.rb

SELECT * FROM "stories" WHERE (votes_count >= 5) ORDER BY id DESC
---
  def index
    @story = Story.find(:first, :order => 'RANDOM()')

INSERT INTO "stories" ("name", "updated_at", "votes_count", "description", "link", "user_id", "created_at") VALUES('a new link', '2009-12-15 00:47:33', 0, 'this is the description for a new link.', 'www.anewlink.com', 1, '2009-12-15 00:47:33')
---
  def create
    @story = @current_user.stories.build params[:story]
    if @story.save

SELECT * FROM "stories" WHERE ("stories"."id" = 1)
---
  def show
    @story = Story.find(params[:id])